/********************************************************************
* 文件名  ： 通用文件.c
* 描述    :  该程序包含两个 ms/us 延时程序和任意数字转字符串程序
********************** =***********************************************/
#include "common.h" 


/********************************************************************
* 名称 : delay_ms()
* 功能 : 延时,延时时间大概为nms
* 输入 : 无
* 输出 : 无
***********************************************************************/
void  delay_ms(uchar nms)
{
#if MAIN_Fosc == 12000000L
    unsigned char i, j;
    do
    {
        i = 2;
        j = 239;
        do
        {
            while (--j);
        }
        while (--i);
    }
    while(--nms);
#elif MAIN_Fosc == 11059200L
    unsigned char i, j;
    do
    {
        _nop_();
        i = 2;
        j = 199;
        do
        {
            while (--j);
        }
        while (--i);
    }
    while(--nms);

#endif
}

